money_capital = 20000  # Подушка безопасности
salary = 5000  # Ежемесячная зарплата
spend = 6000  # Траты за первый месяц
increase = 0.05  # Ежемесячный рост цен

# TODO Посчитайте количество  месяцев, которое можно протянуть без долгов
# Переменная для подсчета месяцев
months = 0

while money_capital >= 0:
    # Расчет бюджета текущего месяца
    current_budget = money_capital + salary

    # Если текущий бюджет меньше, чем расходы, выйти из цикла
    if current_budget < spend:
        break

    # Обновить подушку безопасности
    money_capital = current_budget - spend

    # Увеличение расходов на 5% со второго месяца
    spend *= (1 + increase)

    # Увеличить счетчик месяцев
    months += 1

print("Количество месяцев, которое можно протянуть без долгов:", months)
